config.el
;; [[file:config.org::*PERSONAL INFORMATION][PERSONAL INFORMATION:1]]
(setq user-full-name "Facundo Prieto"
      user-mail-address "facundo.prieto321@gmail.com")
;; PERSONAL INFORMATION:1 ends here

;; [[file:config.org::*Simple settings][Simple settings:1]]
(setq-default
 delete-by-moving-to-trash t                      ; Delete files to trash
 window-combination-resize t                      ; take new window space from all other windows (not just current)
 x-stretch-cursor t)                              ; Stretch cursor to the glyph width

(setq undo-limit 80000000                         ; Raise undo-limit to 80Mb
      evil-want-fine-undo t                       ; By default while in insert all changes are one big blob. Be more granular
      auto-save-default t)                        ; Nobody likes to loose work, I certainly don't

(display-time-mode 1)                             ; Enable time in the mode-line
(unless (equal "Battery status not available"
               (battery))
  (display-battery-mode 1))                       ; On laptops it's nice to know how much power you have
(global-subword-mode 1)                           ; Iterate through CamelCase words
;; Simple settings:1 ends here

;; [[file:config.org::*Windows][Windows:1]]
(setq evil-vsplit-window-right t
      evil-split-window-below t)
;; Windows:1 ends here

;; [[file:config.org::*Windows][Windows:2]]
(defadvice! prompt-for-buffer (&rest _)
  :after '(evil-window-split evil-window-vsplit)
  (+ivy/switch-buffer))
;; Windows:2 ends here

;; [[file:config.org::*Windows][Windows:3]]
(setq +ivy-buffer-preview t)
;; Windows:3 ends here

;; [[file:config.org::*Buffer default][Buffer default:1]]
(setq-default major-mode 'org-mode)
;; Buffer default:1 ends here

;; [[file:config.org::*FONTS][FONTS:1]]
(setq doom-font (font-spec :family "JetBrains Mono" :size 15)
      doom-big-font (font-spec :family "JetBrains Mono" :size 20)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :size 15))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))

;; remove ligatures on python-mode
(set-ligatures! 'python-mode nil)
;; FONTS:1 ends here

;; [[file:config.org::*THEME][THEME:1]]
(setq doom-theme 'doom-vibrant)
(map! :leader
      :desc "Load new theme"
      "h t" #'counsel-load-theme)
;; THEME:1 ends here

;; [[file:config.org::*MISCELLANEOUS][MISCELLANEOUS:1]]
(setq doom-fallback-buffer-name "Doom"
      +doom-dashboard-name "Doom")
;; MISCELLANEOUS:1 ends here

;; [[file:config.org::*MISCELLANEOUS][MISCELLANEOUS:2]]
(custom-set-faces! '(doom-modeline-evil-insert-state :weight bold :foreground "#339CDB"))
;; MISCELLANEOUS:2 ends here

;; [[file:config.org::*BOOKMARKS AND BUFFERS][BOOKMARKS AND BUFFERS:1]]
(map! :leader
      :desc "List bookmarks"
      "b L" #'list-bookmarks
      :leader
      :desc "Save current bookmarks to bookmark file"
      "b w" #'bookmark-save)
;; BOOKMARKS AND BUFFERS:1 ends here

;; [[file:config.org::*EVALUATE ELISP EXPRESSIONS][EVALUATE ELISP EXPRESSIONS:1]]
(map! :leader
      :desc "Evaluate elisp in buffer"
      "e b" #'eval-buffer
      :leader
      :desc "Evaluate defun"
      "e d" #'eval-defun
      :leader
      :desc "Evaluate elisp expression"
      "e e" #'eval-expression
      :leader
      :desc "Evaluate last sexpression"
      "e l" #'eval-last-sexp
      :leader
      :desc "Evaluate elisp in region"
      "e r" #'eval-region)
;; EVALUATE ELISP EXPRESSIONS:1 ends here

;; [[file:config.org::*IVY][IVY:1]]
(map! :leader
      :desc "Ivy push view"
      "v p" #'ivy-push-view
      :leader
      :desc "Ivy switch view"
      "v s" #'ivy-switch-view)

(setq ivy-read-action-function #'ivy-hydra-read-action)
(setq ivy-sort-max-size 50000)
;; IVY:1 ends here

;; [[file:config.org::*LINE SETTINGS][LINE SETTINGS:1]]
(setq display-line-numbers-type t)
(map! :leader
      :desc "Toggle truncate lines"
      "t t" #'toggle-truncate-lines)
;; LINE SETTINGS:1 ends here

;; [[file:config.org::*MANPAGES][MANPAGES:1]]
(require 'ox-groff)
;; MANPAGES:1 ends here

;; [[file:config.org::*NEOTREE][NEOTREE:1]]
(after! neotree
  (setq neo-smart-open t
        neo-window-fixed-size nil))
(after! doom-themes
  (setq doom-neotree-enable-variable-pitch t))
(map! :leader
      :desc "Toggle neotree file viewer"
      "t n" #'neotree-toggle)
;; NEOTREE:1 ends here

;; [[file:config.org::*Tweaking defaults][Tweaking defaults:1]]
(setq org-directory  "~/Documents/Notes/Org/"     ; let's put files here
      org-use-property-inheritance t              ; it's convenient to have properties inherited
      org-log-done 'time                          ; having the time a item is done sounds convininet
      org-list-allow-alphabetical t               ; have a. A. a A list bullets
      org-export-in-background t                  ; run export processes in external emacs process
      org-catch-invisible-edits 'smart            ; try not to accidently do weird stuff in invisible regions
      org-re-reveal-root "https://cdn.jsdelivr.net/npm/reveal.js"
      +org-capture-todo-file "~/Documents/Notes/Org/Todo.org"
      org-agenda-files
      '("~/Documents/Notes/Org/Tasks.org"
        "~/Documents/Notes/Org/Habits.org"
        "~/Documents/Notes/Org/Journal.org"
        "~/Documents/Notes/Org/Agenda.org")
      org-journal-dir "~/Documents/Notes/Org/journal/"
      org-journal-date-format "%A, %d %B %Y"
      org-journal-file-format "%Y-%m-%d.org")
;; Tweaking defaults:1 ends here
