config.org
*** TAGs & TODO keywords
#+BEGIN_SRC emacs-lisp
(setq org-todo-keywords
      '(
        (sequence "TODO(t)" "IDEA(i)" "STARTED(s)" "NEXT(n)" "WAITING(w)" "METTING(m)" "FIXME" "|" "DONE(d)")
        (sequence "[ ](T)" "[-](S)" "SOMEDAY(f)" "|" "[X](D)" "CANCELED(c)" "DELEGATED(l)")
        ))
(setq org-todo-keyword-faces
      '(("IDEA" . (:foreground "GoldenRod" :weight bold))
        ("NEXT" . (:foreground "IndianRed1" :weight bold))
        ("STARTED" . (:foreground "OrangeRed" :weight bold))
        ("[-]" . (:foreground "OrangeRed" :weight bold))
        ("WAITING" . (:foreground "coral" :weight bold))
        ("CANCELED" . (:foreground "LimeGreen" :weight bold))
        ("DELEGATED" . (:foreground "LimeGreen" :weight bold))
        ("SOMEDAY" . (:foreground "LimeGreen" :weight bold))
        ))
#+END_SRC
TAGs persistent alist
#+BEGIN_SRC emacs-lisp
(setq org-tag-persistent-alist
      '(
        ("HOME" . ?h)
        ("RESEARCH" . ?r)
        ("DEV" . ?d)
        ("EMACS" . ?s)
        ("THINK" . ?t)
        ("EASY" . ?e)
        ("MEDIUM" . ?m)
        ("HARD" . ?a)
        ("URGENT" . ?u)
        ("FACULTAD" . ?f)
        ("FISICA" . ?i)
        ("ANALISIS" . ?n)
        ("ALGORITMOS" . ?l)
        ("PARCIAL" . ?p)
        ("TP" . ?T)
        ))
(setq org-tag-faces
      '(
        ("HOME" . (:foreground "GoldenRod" :weight bold))
        ("RESEARCH" . (:foreground "GoldenRod" :weight bold))
        ("THINK" . (:foreground "GoldenRod" :weight bold))
        ("DEV" . (:foreground "IndianRed1" :weight bold))
        ("EMACS" . (:foreground "IndianRed1" :weight bold))
        ("URGENT" . (:foreground "Red" :weight bold))
        ("EASY" . (:foreground "OrangeRed" :weight bold))
        ("MEDIUM" . (:foreground "OrangeRed" :weight bold))
        ("HARD" . (:foreground "OrangeRed" :weight bold))
        ("FACULTAD" . (:foreground "GoldenRod" :weight bold))
        ("FISICA" . (:foreground "LimeGreen" :weight bold))
        ("ANALISIS" . (:foreground "LimeGreen" :weight bold))
        ("ALGORITMOS" . (:foreground "LimeGreen" :weight bold))
        ("PARCIAL" . (:foreground "LimeGreen" :weight bold))
        ("TP" . (:foreground "LimeGreen" :weight bold))
        ))
#+END_SRC
*** Headers default arguments
#+BEGIN_SRC emacs-lisp
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link")))
#+END_SRC
*** Prevents some error with ~visual-line-mode~ and ~auto-fill-mode~
#+BEGIN_SRC emacs-lisp
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
#+END_SRC
*** Arrow keys equivalents
#+BEGIN_SRC emacs-lisp
(map! :map evil-org-mode-map
      :after evil-org
      :n "g <up>" #'org-backward-heading-same-level
      :n "g <down>" #'org-forward-heading-same-level
      :n "g <left>" #'org-up-element
      :n "g <right>" #'org-down-element)
#+END_SRC
*** Bullets and priorities
Set the priority faces and elipsis
#+BEGIN_SRC emacs-lisp
(after! org-superstar
  (setq org-superstar-headline-bullets-list '("◦""•")
        org-superstar-prettify-item-bullets t ))

(use-package org-fancy-priorities
  :ensure t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '((?A . "■ 5")
                                    (?B . "■ 4")
                                    (?C . "■ 3")
                                    (?D . "■ 2")
                                    (?E . "■ 1"))))
(after! org
  (setq org-ellipsis " ▾ "
        org-cycle-separator-lines -1
        org-priority-highest ?A
        org-priority-lowest ?E
        org-priority-default ?C
        org-priority-faces
        '((?A . 'all-the-icons-red)
          (?B . 'all-the-icons-orange)
          (?C . 'all-the-icons-yellow)
          (?D . 'all-the-icons-green)
          (?E . 'all-the-icons-blue))))
#+END_SRC
** Extra Functionality
*** Make easier the creation of a org buffer
#+BEGIN_SRC emacs-lisp
(evil-define-command evil-buffer-org-new (count file)
  "Creates a new ORG buffer replacing the current window, optionally
   editing a certain FILE"
  :repeat nil
  (interactive "P<f>")
  (if file
      (evil-edit file)
    (let ((buffer (generate-new-buffer "*new org*")))
      (set-window-buffer nil buffer)
      (with-current-buffer buffer
        (org-mode)))))
(map! :leader
      (:prefix "b"
       :desc "New empty ORG buffer" "o" #'evil-buffer-org-new))
#+END_SRC
*** List bullet sequence
List bullets change with depth
#+BEGIN_SRC emacs-lisp
(setq org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+") ("1." . "a.")))
#+END_SRC
*** Citation
Cite something
#+BEGIN_SRC emacs-lisp
(use-package! org-ref
  :after org
  :config
  (setq org-ref-completion-library 'org-ref-ivy-cite))
#+END_SRC
** Super agenda
;;#+BEGIN_SRC emacs-lisp
(use-package! org-super-agenda
  :commands (org-super-agenda-mode))
(after! org-agenda
  (org-super-agenda-mode))

(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-block-separator nil
      org-agenda-tags-column 100 ;; from testing this seems to be a good value
      org-agenda-compact-blocks t)

(let ((org-agenda-span 'day)
      (org-super-agenda-groups
       '((:name "Time grid items in all-uppercase with RosyBrown1 foreground"
          :time-grid t
          :transformer (--> it
                            (upcase it)
                            (propertize it 'face '(:foreground "RosyBrown1"))))
         (:name "Priority >= C items underlined, on black background"
          :face (:background "black" :underline t)
          :not (:priority>= "C")
          :order 100))))
  (org-agenda nil "a"))
;;#+END_SRC
