config.el

;; [[file:config.org::*TAGs & TODO keywords][TAGs & TODO keywords:1]]
(setq org-todo-keywords
      '(
        (sequence "TODO(t)" "IDEA(i)" "STARTED(s)" "NEXT(n)" "WAITING(w)" "METTING(m)" "FIXME" "|" "DONE(d)")
        (sequence "[ ](T)" "[-](S)" "SOMEDAY(f)" "|" "[X](D)" "CANCELED(c)" "DELEGATED(l)")
        ))
(setq org-todo-keyword-faces
      '(("IDEA" . (:foreground "GoldenRod" :weight bold))
        ("NEXT" . (:foreground "IndianRed1" :weight bold))
        ("STARTED" . (:foreground "OrangeRed" :weight bold))
        ("[-]" . (:foreground "OrangeRed" :weight bold))
        ("WAITING" . (:foreground "coral" :weight bold))
        ("CANCELED" . (:foreground "LimeGreen" :weight bold))
        ("DELEGATED" . (:foreground "LimeGreen" :weight bold))
        ("SOMEDAY" . (:foreground "LimeGreen" :weight bold))
        ))
;; TAGs & TODO keywords:1 ends here

;; [[file:config.org::*TAGs & TODO keywords][TAGs & TODO keywords:2]]
(setq org-tag-persistent-alist
      '(
        ("HOME" . ?h)
        ("RESEARCH" . ?r)
        ("DEV" . ?d)
        ("EMACS" . ?s)
        ("THINK" . ?t)
        ("EASY" . ?e)
        ("MEDIUM" . ?m)
        ("HARD" . ?a)
        ("URGENT" . ?u)
        ("FACULTAD" . ?f)
        ("FISICA" . ?i)
        ("ANALISIS" . ?n)
        ("ALGORITMOS" . ?l)
        ("PARCIAL" . ?p)
        ("TP" . ?T)
        ))
(setq org-tag-faces
      '(
        ("HOME" . (:foreground "GoldenRod" :weight bold))
        ("RESEARCH" . (:foreground "GoldenRod" :weight bold))
        ("THINK" . (:foreground "GoldenRod" :weight bold))
        ("DEV" . (:foreground "IndianRed1" :weight bold))
        ("EMACS" . (:foreground "IndianRed1" :weight bold))
        ("URGENT" . (:foreground "Red" :weight bold))
        ("EASY" . (:foreground "OrangeRed" :weight bold))
        ("MEDIUM" . (:foreground "OrangeRed" :weight bold))
        ("HARD" . (:foreground "OrangeRed" :weight bold))
        ("FACULTAD" . (:foreground "GoldenRod" :weight bold))
        ("FISICA" . (:foreground "LimeGreen" :weight bold))
        ("ANALISIS" . (:foreground "LimeGreen" :weight bold))
        ("ALGORITMOS" . (:foreground "LimeGreen" :weight bold))
        ("PARCIAL" . (:foreground "LimeGreen" :weight bold))
        ("TP" . (:foreground "LimeGreen" :weight bold))
        ))
;; TAGs & TODO keywords:2 ends here

;; [[file:config.org::*Headers default arguments][Headers default arguments:1]]
(setq org-babel-default-header-args
      '((:session . "none")
        (:results . "replace")
        (:exports . "code")
        (:cache . "no")
        (:noweb . "no")
        (:hlines . "no")
        (:tangle . "no")
        (:comments . "link")))
;; Headers default arguments:1 ends here

;; [[file:config.org::*Prevents some error with ~visual-line-mode~ and ~auto-fill-mode~][Prevents some error with ~visual-line-mode~ and ~auto-fill-mode~:1]]
(remove-hook 'text-mode-hook #'visual-line-mode)
(add-hook 'text-mode-hook #'auto-fill-mode)
;; Prevents some error with ~visual-line-mode~ and ~auto-fill-mode~:1 ends here

;; [[file:config.org::*Arrow keys equivalents][Arrow keys equivalents:1]]
(map! :map evil-org-mode-map
      :after evil-org
      :n "g <up>" #'org-backward-heading-same-level
      :n "g <down>" #'org-forward-heading-same-level
      :n "g <left>" #'org-up-element
      :n "g <right>" #'org-down-element)
;; Arrow keys equivalents:1 ends here

;; [[file:config.org::*Bullets and priorities][Bullets and priorities:1]]
(after! org-superstar
  (setq org-superstar-headline-bullets-list '("◦""•")
        org-superstar-prettify-item-bullets t ))

(use-package org-fancy-priorities
  :ensure t
  :hook
  (org-mode . org-fancy-priorities-mode)
  :config
  (setq org-fancy-priorities-list '((?A . "■ 5")
                                    (?B . "■ 4")
                                    (?C . "■ 3")
                                    (?D . "■ 2")
                                    (?E . "■ 1"))))
(after! org
  (setq org-ellipsis " ▾ "
        org-cycle-separator-lines -1
        org-priority-highest ?A
        org-priority-lowest ?E
        org-priority-default ?C
        org-priority-faces
        '((?A . 'all-the-icons-red)
          (?B . 'all-the-icons-orange)
          (?C . 'all-the-icons-yellow)
          (?D . 'all-the-icons-green)
          (?E . 'all-the-icons-blue))))
;; Bullets and priorities:1 ends here

;; [[file:config.org::*Make easier the creation of a org buffer][Make easier the creation of a org buffer:1]]
(evil-define-command evil-buffer-org-new (count file)
  "Creates a new ORG buffer replacing the current window, optionally
   editing a certain FILE"
  :repeat nil
  (interactive "P<f>")
  (if file
      (evil-edit file)
    (let ((buffer (generate-new-buffer "*new org*")))
      (set-window-buffer nil buffer)
      (with-current-buffer buffer
        (org-mode)))))
(map! :leader
      (:prefix "b"
       :desc "New empty ORG buffer" "o" #'evil-buffer-org-new))
;; Make easier the creation of a org buffer:1 ends here

;; [[file:config.org::*List bullet sequence][List bullet sequence:1]]
(setq org-list-demote-modify-bullet '(("+" . "-") ("-" . "+") ("*" . "+") ("1." . "a.")))
;; List bullet sequence:1 ends here

;; [[file:config.org::*Citation][Citation:1]]
(use-package! org-ref
  :after org
  :config
  (setq org-ref-completion-library 'org-ref-ivy-cite))
;; Citation:1 ends here
