config.org
** Capture templates
Cofiguration
#+BEGIN_SRC emacs-lisp
;; semi full screen for capture (I only need in some capture templates this funcionality)
;;(add-hook 'org-capture-mode-hook 'doom/window-enlargen)
(setq +org-capture-tasks  "~/Documents/Notes/Org/Tasks.org")
(setq org-capture-templates
      (doct '(("Facultad" :keys "f"
               :file +org-capture-tasks
               :prepend t
               :template ("* [ ] %^{Description} "
                          ":PROPERTIES:"
                          ":Created: %U"
                          ":END:"
                          )
               :children (("Algoritmos" :keys "a"
                           :olp ("Facultad" "Algoritmos")
                           :hook (lambda () (message "New task on Algoritmos"))
                           :template ("* [ ] %^{Description} "
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      "%a"
                                      ))
                          ("Analisis" :keys "n"
                           :olp ("Facultad" "Analisis")
                           :hook (lambda () (message "New task on Analisis")))
                          ("Fisica" :keys "f"
                           :olp ("Facultad" "Fisica")
                           :hook (lambda () (message "New task on Fisica")))))
              ("Tasks" :keys "t"
               :file +org-capture-tasks
               :prepend t
               :headline  "Inbox"
               :children (("Task"  :keys "t"
                           :template ("* [ ] %^{Description}"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      )
                           :hook (lambda () (message "New task on Inbox")))
                          ("Task with reference" :keys "r"
                           :template ("* [ ] %^{Description}"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      "%a"
                                      )
                           :hook (lambda () (message "New task on Inbox")))))
              ("Programacion" :keys "p"
               :file +org-capture-tasks
               :prepend t
               :olp ("Programacion" "Inbox")
               :children (("Fixme"  :keys "f"
                           :template ("* FIXME %^{Description}"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      "%a"
                                      )
                           :hook (lambda () (message "New task on Programacion/Inbox")))
                          ("Task" :keys "t"
                           :template ("* [ ] %^{Description}"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      )
                           :hook (lambda () (message "New task on Programacion/Inbox")))
                          ("Task with reference" :keys "r"
                           :template ("* [ ] %^{Description}"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      "%a"
                                      )
                           :hook (lambda () (message "New task on Programacion/Inbox")))))
              ("Notes" :keys "n"
               :file "~/Documents/Notes/Org/Notes.org"
               :prepend t
               :template ("* %^{Description}"
                          ":PROPERTIES:"
                          ":Created: %U"
                          ":END:"
                          )
               :hook (lambda () (message "New Note")))
              ("Links" :keys "l"
               :file "~/Documents/Notes/Org/Links.org"
               :prepend t
               :type entry
               :headline "Inbox"
               :children (("Simple link" :keys "l"
                           :template ("* [[%^{Link}][%^{Description}]]"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:"
                                      ))
                          ("Cliplink" :keys "c"
                           :template ("* %(org-cliplink-capture)"
                                      ":PROPERTIES:"
                                      ":Created: %U"
                                      ":END:")))

               :hook (lambda () (message "New Link")))
              ("Agenda" :keys "a"
               :file "~/Documents/Notes/Org/Agenda.org"
               :prepend t
               :headline "Inbox"
               :template ("* [ ] %^{Description}"
                          "DEADLINE: %^{Due date:}t"
                          ":PROPERTIES:"
                          ":Created: %U"
                          ":END:")
               :hook (lambda () (message "New Deadline")))
              ("Journal" :keys "j"
               :file "~/Documents/Notes/Org/Journal.org"
               :datetree nil|t
               :prepend t
               :type entry
               :hook (lambda () (doom/window-enlargen))
               :children (("Journal" :keys "j"
                           :template ("\n* %<%I:%M %p> - Diario \n%?\n\n"))
                          ("Rutina matutina" :keys "r"
                           :template ("* Rutina matutina \n/mr%?"
                                      "* Agradecimientos / Motivacion"))))
              )))
#+END_SRC
** Habits
#+BEGIN_SRC emacs-lisp
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column 60)
#+END_SRC
** Visuals
*** Font Display
Make headings a bit bigger
#+BEGIN_SRC emacs-lisp
(custom-set-faces!
  '(outline-1 :weight semi-bold :height 1.25)
  '(outline-2 :weight semi-bold :height 1.15)
  '(outline-3 :weight semi-bold :height 1.12)
  '(outline-4 :weight semi-bold :height 1.09)
  '(outline-5 :weight semi-bold :height 1.06)
  '(outline-6 :weight semi-bold :height 1.03)
  '(outline-8 :weight semi-bold)
  '(outline-9 :weight semi-bold))
#+END_SRC
Make the title bigger
#+BEGIN_SRC emacs-lisp
(after! org
  (custom-set-faces!
    '(org-document-title :height 1.2)))
#+END_SRC
