config.el
  (appendq! +ligatures-extra-symbols
            `(:list_property "∷"
              :em_dash       "—"
              :ellipses      "…"
              :title         "𝙏"
              :subtitle      "𝙩"
              :author        "𝘼"
              :date          "𝘿"
              :property      "☸"
              :options       "⌥"
              :latex_class   "🄲"
              :latex_header  "⇥"
              :beamer_header "↠"
              :attr_latex    "🄛"
              :attr_html     "🄗"
              :begin_quote   "❮"
              :end_quote     "❯"
              :caption       "☰"
              :header        "›"
              :results       "➥"
              :begin_export  "⯮"
              :end_export    "⯬"
              :properties    "⚙"
              :end           "∎"))
  (set-ligatures! 'org-mode
    :merge t
    :list_property "::"
    :em_dash       "---"
    :ellipsis      "..."
    :title         "#+title:"
    :subtitle      "#+subtitle:"
    :author        "#+author:"
    :date          "#+date:"
    :property      "#+property:"
    :options       "#+options:"
    :latex_class   "#+latex_class:"
    :latex_header  "#+latex_header:"
    :beamer_header "#+beamer_header:"
    :attr_latex    "#+attr_latex:"
    :attr_html     "#+attr_latex:"
    :begin_quote   "#+begin_quote"
    :end_quote     "#+end_quote"
    :caption       "#+caption:"
    :header        "#+header:"
    :begin_export  "#+begin_export"
    :end_export    "#+end_export"
    :results       "#+RESULTS:"
    :property      ":PROPERTIES:"
    :end           ":END:"))
(plist-put +ligatures-extra-symbols :name "⁍")
;; Symbols:1 ends here

;; [[file:config.org::*Exporting (general)][Exporting (general):1]]
(after! org (setq org-export-headline-levels 5)) ; I like nesting
(after! org
  (require 'ox-extra)
  (ox-extras-activate '(ignore-headlines)))
;; Exporting (general):1 ends here

;; [[file:config.org::*Babel][Babel:1]]
(setq org-babel-python-command "python3")
;; Babel:1 ends here

;; [[file:config.org::*Babel][Babel:2]]
(defun tec-org-python ()
  (if (eq major-mode 'python-mode)
      (progn (anaconda-mode t)
             (company-mode t))))
(add-hook 'org-src-mode-hook 'tec-org-python)
;; Babel:2 ends here

;; [[file:config.org::*Automatically "Tangle" on Save][Automatically "Tangle" on Save:1]]
;; Since we don't want to disable org-confirm-babel-evaluate all
;; of the time, do it around the after-save-hook
(defun dw/org-babel-tangle-dont-ask ()
  ;; Dynamic scoping to the rescue
  (let ((org-confirm-babel-evaluate nil))
    (org-babel-tangle)))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'dw/org-babel-tangle-dont-ask
                                              'run-at-end 'only-in-org-mode)))
;; Automatically "Tangle" on Save:1 ends here

;; [[file:config.org::*DEFT][DEFT:1]]
(setq deft-directory "~/Documents/Notes"
      deft-extensions '("txt" "org" "md")
      deft-recursive t)
;; DEFT:1 ends here

;; [[file:config.org::*REGISTERS][REGISTERS:1]]
(map! :leader
      :desc "Copy to register"
      "r c" #'copy-to-register
      :leader
      :desc "Frameset to register"
      "r f" #'frameset-to-register
      :leader
      :desc "Insert contents of register"
      "r i" #'insert-register
      :leader
      :desc "Jump to register"
      "r j" #'jump-to-register
      :leader
      :desc "List registers"
      "r l" #'list-registers
      :leader
      :desc "Number to register"
      "r n" #'number-to-register
      :leader
      :desc "Interactively choose a register"
      "r r" #'counsel-register
      :leader
      :desc "View a register"
      "r v" #'view-register
      :leader
      :desc "Window configuration to register"
      "r w" #'window-configuration-to-register
      :leader
      :desc "Increment register"
      "r +" #'increment-register
      :leader
      :desc "Point to register"
      "r SPC" #'point-to-register)
;; REGISTERS:1 ends here

;; [[file:config.org::*SHELLS][SHELLS:1]]
(setq shell-file-name "/bin/zsh"
      eshell-aliases-file "~/.doom.d/aliases")
;; SHELLS:1 ends here

;; [[file:config.org::*SPLITS][SPLITS:1]]
(defun prefer-horizontal-split ()
  (set-variable 'split-height-threshold nil t)
  (set-variable 'split-width-threshold 40 t)) ; make this as low as needed
(add-hook 'markdown-mode-hook 'prefer-horizontal-split)
(map! :leader
      :desc "Clone indirect buffer other window"
      "b c" #'clone-indirect-buffer-other-window)
;; SPLITS:1 ends here

;; [[file:config.org::*SUBLIMITY][SUBLIMITY:1]]
(require 'sublimity-scroll)
(require 'sublimity-attractive)
(sublimity-mode 0)
;; SUBLIMITY:1 ends here

;; [[file:config.org::*CENTAUR TABS][CENTAUR TABS:1]]
(after! centaur-tabs
  (centaur-tabs-mode -1)
  (setq centaur-tabs-height 36
        centaur-tabs-set-icons t
        centaur-tabs-modified-marker "o"
        centaur-tabs-close-button "×"
        centaur-tabs-set-bar 'above
        centaur-tabs-gray-out-icons 'buffer)
  (centaur-tabs-change-fonts "P22 Underground Book" 160))
;; (setq x-underline-at-descent-line t)
;; CENTAUR TABS:1 ends here

;; [[file:config.org::*COMPANY][COMPANY:1]]
(after! company
  (setq company-idle-delay 0.5
        company-minimum-prefix-length 2)
  (setq company-show-numbers t)
  (add-hook 'evil-normal-state-entry-hook #'company-abort)) ;; make aborting less annoying.
;; COMPANY:1 ends here

;; [[file:config.org::*COMPANY][COMPANY:2]]
(setq-default history-length 1000)
(setq-default prescient-history-length 1000)
;; COMPANY:2 ends here

;; [[file:config.org::*ESS][ESS:1]]
(set-company-backend! 'ess-r-mode '(company-R-args company-R-objects company-dabbrev-code :separate))
;; ESS:1 ends here

;; [[file:config.org::*EROS-EVAL][EROS-EVAL:1]]
(setq eros-eval-result-prefix "⟹ ")
;; EROS-EVAL:1 ends here

;; [[file:config.org::*EVIL][EVIL:1]]
(after! evil-escape (evil-escape-mode -1))
;; EVIL:1 ends here

;; [[file:config.org::*EVIL][EVIL:2]]
(after! evil (setq evil-ex-substitute-global t)) ; I like my s/../.. to by global by default
;; EVIL:2 ends here

;; [[file:config.org::*INFO COLORS][INFO COLORS:1]]
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)

(add-hook 'Info-mode-hook #'mixed-pitch-mode)
;; INFO COLORS:1 ends here

;; [[file:config.org::*MAGIT][MAGIT:1]]
(after! magit
     (magit-delta-mode +1))
;; MAGIT:1 ends here
